fix note
